#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПромптПодсказка = РегистрыСведений.ИИ_НастройкиПользователей.ПолучитьПромптПодсказкуПользователя();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	СохранитьНастройкиНаСервере();
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СохранитьНастройкиНаСервере()
	
	РегистрыСведений.ИИ_НастройкиПользователей.УстановитьПромптПодсказкуПользователя(ПромптПодсказка);
	
КонецПроцедуры

#КонецОбласти
